PERIOD = 'Все время за период с'
PERIOD_ = 'вы находились на территории РФ?'
RESIDENT = 'Вы резидент страны'
NON_RESIDENT = 'Вы нерезидент страны'
PRD_EXIT = 'Въезжали ли Вы за этот период в РФ?'
DATES = 'Напишите все даты выездов и въездов(год месяц день):'
RES_Q_1 = '''Вы получали доходы в виде процентов по облигациям с:
ипотечным покрытием, эмитированным до 1 января 2007 года, а также доходы учредителей доверительного управления ипотечным покрытием, 
полученные на основании приобретения ипотечных сертификатов участия, выданных управляющим ипотечным покрытием до 1 января 2007 года?'''
RES_Q_2 = '''Ваш доход был получен от любых выигрышей и призов, получаемых в проводимых конкурсах, 
играх и других мероприятиях в целях рекламы товаров, работ и услуг, в части превышения размеров, указанных далее? 
1. суммы материальной помощи, оказываемой инвалидам общественными организациями инвалидов; 
2. суммы материальной помощи, оказываемой организацией, осуществляющей образовательную деятельность по основным профессиональным образовательным программам, 
студентам (курсантам), аспирантам, адъюнктам, ординаторам и ассистентам-стажерам; 
3.суммы материальной помощи, оказываемой работодателями своим работникам, а также бывшим своим работникам, 
уволившимся в связи с выходом на пенсию по инвалидности или по возрасту; 
4.стоимость подарков, полученных налогоплательщиками от организаций или индивидуальных предпринимателей; 
5.стоимость призов в денежной и натуральной формах, полученных налогоплательщиками на конкурсах и соревнованиях, проводимых в соответствии с решениями Правительства Российской Федерации, 
законодательных (представительных) органов государственной власти или представительных органов местного самоуправления; 
6.возмещение (оплата) работодателями своим работникам, их супругам, родителям, детям (в том числе усыновленным), подопечным (в возрасте до 18 лет), бывшим своим работникам (пенсионерам по возрасту), 
а также инвалидам стоимости приобретенных ими (для них) лекарственных препаратов для медицинского применения, назначенных им лечащим врачом. 
Освобождение от налогообложения предоставляется при представлении документов, подтверждающих фактические расходы на приобретение этих лекарственных препаратов для медицинского применения; 
7.стоимость любых выигрышей и призов, получаемых в проводимых конкурсах, играх и других мероприятиях в целях рекламы товаров (работ, услуг); 
8.стоимость выигрышей, полученных участниками азартных игр и участниками лотерей; 
9.1.доходы, полученные в период до 1 января 2029 года от продажи электрической энергии, произведенной на объектах микрогенерации, принадлежащих налогоплательщику на праве собственности или ином законном основании.'''
RES_Q_3 = '''Ваш доход был получен от суммы экономии на процентах при получении налогоплательщиками заемных (кредитных) средств в части превышения размеров, указанных в п. 2 ст. 212 НК РФ; 
(1)если иное не предусмотрено настоящим подпунктом, материальная выгода, полученная от экономии на процентах за пользование налогоплательщиком заемными (кредитными) средствами, 
полученными от организаций или индивидуальных предпринимателей, за исключением: подробнее в п. 2 ст. 212 НК РФ;) 
1.превышение суммы процентов за пользование заемными (кредитными) средствами, выраженными в рублях, исчисленной исходя из двух третьих действующей ставки рефинансирования, 
установленной Центральным банком Российской Федерации на дату фактического получения налогоплательщиком дохода, над суммой процентов, исчисленной исходя из условий договора; 
2.превышение суммы процентов за пользование заемными (кредитными) средствами, выраженными в иностранной валюте, исчисленной исходя из 9 процентов годовых, над суммой процентов, исчисленной исходя из условий договора. 
*Определение налоговой базы при получении дохода в виде материальной выгоды, полученной от экономии на процентах при получении заемных (кредитных) средств, исчисление, удержание и перечисление налога осуществляются налоговым агентом в порядке, 
установленном настоящим Кодексом.'''
RES_Q_4 = '''Ваш доход был получен от доходов в виде платы за использование денежных средств членов кредитного потребительского кооператива (пайщиков), а также процентов за использование сельскохозяйственным кредитным потребительским кооперативом средств,
привлекаемых в форме займов от членов сельскохозяйственного кредитного потребительского кооператива или ассоциированных членов сельскохозяйственного кредитного потребительского кооператива, налоговая база по которым определяется в соответствии со ст. 214.2.1 НК РФ?
Статья 214.2.1. Особенности определения налоговой базы при получении доходов в виде платы за использование денежных средств членов кредитного потребительского кооператива (пайщиков), процентов за использование сельскохозяйственным кредитным потребительским кооперативом средств,
привлекаемых в форме займов от членов сельскохозяйственного кредитного потребительского кооператива или ассоциированных членов сельскохозяйственного кредитного потребительского кооператива (введена Федеральным законом от 27.07.2010 N 207-ФЗ) 
1. В отношении доходов в виде платы за использование денежных средств членов кредитного потребительского кооператива (пайщиков), процентов за использование сельскохозяйственным кредитным потребительским кооперативом средств, привлекаемых в форме займов от членов сельскохозяйственного кредитного потребительского кооператива
или ассоциированных членов сельскохозяйственного кредитного потребительского кооператива, налоговая база определяется как превышение суммы указанной платы, процентов, начисленных в начисленных в соответствии с условиями договора, над суммой платы, процентов,
рассчитанной исходя из ставки рефинансирования Центрального банка Российской Федерации, увеличенной на пять процентных пунктов, действующей в течение периода, за который начислены указанные проценты. 
2. При определении налоговой базы не учитываются доходы в случае, если проценты, исходя из которых рассчитана сумма платы за использование денежных средств членов кредитного потребительского кооператива (пайщиков), проценты за использование сельскохозяйственным кредитным потребительским кооперативом средств,
привлекаемых в форме займов от членов сельскохозяйственного кредитного потребительского кооператива или ассоциированных членов сельскохозяйственного кредитного потребительского кооператива, которые на дату заключения договора либо продления договора были установлены в размере,
не превышающем действующую ставку рефинансирования Центрального банка Российской Федерации, увеличенную на пять процентных пунктов, при условии, что в течение периода начисления процентов размер процентов по договору не повышался и с момента, когда процентная ставка по договору превысила ставку рефинансирования Центрального банка Российской Федерации,
увеличенную на пять процентных пунктов, прошло не более трех лет. 
3. В отношении доходов в виде платы за использование денежных средств членов кредитного потребительского кооператива (пайщиков), процентов за использование сельскохозяйственным кредитным потребительским кооперативом средств, привлекаемых в форме займов от членов сельскохозяйственного кредитного потребительского кооператива
или ассоциированных членов сельскохозяйственного кредитного потребительского кооператива, начисленных за период с 15 декабря 2014 года по 31 декабря 2015 года, при определении налоговой базы ставка рефинансирования Центрального банка Российской Федерации увеличивается на десять процентных пунктов. 
(п. 3 введен Федеральным законом от 23.11.2015 N 320-ФЗ) 
4. В отношении доходов, налоговая база по которым определяется в соответствии с настоящей статьей, налог исчисляется, удерживается и перечисляется налоговым агентом.'''
RES_Q_5 = '''Ваш доход был получен от продажи имущества (за исключением ценных бумаг) и (или) доли (долей) в нем, доходов в виде стоимости имущества (за исключением ценных бумаг), полученного в порядке дарения, а также подлежащих налогообложению доходов, полученных такими физическими лицами в виде страховых выплат по договорам страхования и выплат по пенсионному обеспечению? '''
RES_Q_6 = '''Ваша налоговая база составляет более 5 миллионов рублей?'''
NONRES_Q_1 = 'Ваш доход был получен в виде дивидендов от долевого участия в деятельности российских компаний?'
NONRES_Q_2 = 'Ваш доход был получен в виде выплат, не связанных с выкупом цифровых финансовых активов, в случае, если решением о выпуске этих цифровых финансовых активов предусмотрена выплата дохода в сумме, равной сумме дивидендов, полученных лицом, выпустившим эти цифровые финансовые активы?'
NONRES_Q_3 = 'Ваш доход был получен в виде дивидендов по акциям (долям) международных холдинговых компаний, которые являются публичными компаниями на день принятия решения такой компании о выплате дивидендов?'
NONRES_Q_4 = 'Ваш доход был получен от осуществления трудовой деятельности (или если вы вдруг являетесь членом экипажей судов, плавающих под Государственным флагом РФ, то от исполнения трудовых обязанностей)?'
NONRES_Q_5 = 'Сумма Вашего дохода за год составляет более 5 миллионов рублей?'
NONRES_Q_6 = 'Ваш доход был получен в виде процентов по вкладам (остаткам на счетах) в банках, находящихся на территории РФ?'
CURRENCY = 'рублей'
ANSWER = 'Ваш налог составляет'
R_1 = 'вы выезжали с территориии РФ в период с'
R_2 = 'по'
R_3 = '?'
R_4 = 'да'
R_5 = 'Введите количество поездок: (одной поездкой считается выезд из РФ и возращение обратно)'
R_6 = 'дата выезда из РФ (гггг-мм-дд): '
R_7 = 'дата въезда в РФ (гггг-мм-дд): '
R_8 = 'резидент'
R_9 = 'нерезидент'
R_NO = 'нет'
